wk06/d5/SecretShareAjax/app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("created_at", "in_friend_id", "out_friend_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 11 Jul 2014 18:43:54 UTC +00:00], ["in_friend_id", 6], ["out_friend_id", 3], ["updated_at", Fri, 11 Jul 2014 18:43:54 UTC +00:00]]
---
  def create
    sleep(2)
    friendship = Friendship.new(out_friend_id: current_user.id,
                                 in_friend_id: params[:user_id])
    if friendship.save

DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 25]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", "'39'"]]
---
  def destroy
    sleep(2)
    Friendship.find(params[:id]).destroy