wk06/d5/SecretShareAjax/app/controllers/secrets_controller.rb

  def create
    sleep(2)
    recipient = User.find(secret_params[:recipient_id])
    @secret = current_user.authored_secrets.new(secret_params)
    if @secret.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "secrets" ("author_id", "created_at", "recipient_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"