wk07/d2/Journal/app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "body of the post"], ["created_at", "2014-07-15 17:55:25.049121"], ["title", "1st post"], ["updated_at", "2014-07-15 17:55:25.049121"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 7  [["title", "better name"], ["updated_at", "2014-07-16 00:48:16.245350"]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)