wk07/d1/PhotoTagger/app/controllers/api/photos_controller.rb

  def create
    @photo = current_user.photos.new(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("created_at", "owner_id", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 14 Jul 2014 20:41:35 UTC +00:00], ["owner_id", 1], ["title", "blah blah"], ["updated_at", Mon, 14 Jul 2014 20:41:35 UTC +00:00], ["url", "www.google.com"]]

  def index
    @photos = Photo.where("owner_id = ?", params[:user_id])
---
SELECT "photos".* FROM "photos" WHERE (owner_id = '1')

  def update
    @photo = Photo.find(params[:id])
    if @photo.update_attributes(photo_params)
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "photos" SET "title" = $1, "updated_at" = $2 WHERE "photos"."id" = 2  [["title", "new title"], ["updated_at", Mon, 14 Jul 2014 20:57:17 UTC +00:00]]