wk06/d5/SecretShareAjax/app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<ul>
<% User.all.each do |user| %>

SELECT "friendships".* FROM "friendships" WHERE "friendships"."in_friend_id" = $1 AND "friendships"."out_friend_id" = 5 LIMIT 1  [["in_friend_id", 3]]
---
        class='friend-buttons unfriend'
        <% friendship = user.in_friendships
                            .find_by(out_friend_id: current_user.id) %>